using System;
using System.Collections.Generic;
using System.ComponentModel;
using System.Data;
using System.Drawing;
using System.Linq;
using System.Text;
using System.Windows.Forms;

namespace Horoskop
{
    public partial class Form1 : Form
    {
        static int x = 200;
        static int y = 200;

       
        public Form1()
        {
            
            InitializeComponent();
            f2 = new Form2();
           
            
        }
        Form2 f2 = new Form2();

        private void pictureBox1_Click(object sender, EventArgs e)
        {
            
            biklbl.BackColor = Color.Orchid;
            Form2 f2 = new Form2();
            f2.Visible=true;
            f2.Activate();
            f2.SetDesktopLocation(x, y);


            f2.SetZnak("БИК \n(20.04 – 20.05)");
            
            f2.setDneven("Делувате расеано и дозволувате да ви ги откријат професионалните планови и намери. Поради лошите проценки ќе почувствувате извесно зголемена тензија на средба со \nделовните соработници. Среќата е на ваша страна, а некоја личност ви покажува искрени чувста. Важно е да направите добар избор. Избегнувајте ситуации кои психички ве потресуваат.");
            f2.setNedelen("Работа Ќе помислите дека ништо не ви оди од рака. Односите со околината ви се лоши, а нема да се сложувате ниту со претпоставените ниту со колегите на работа. Ќе биде нагласен отпорот и ограничувањата. Ве советуваме да се воздржите, бидејќи во вашите настојувања нема да бидете многу успешни. Иницијативата во врска со некоја важна работа препуштете му ја на личност која е одговорна за нејзино извршување. Некои од вас ќе имаат прилика да заработат пари неочекувано.\n Љубов И приватните односи ќе ви бидат во криза, внимавајте од љубомора. Оние кои се во брак ќе треба цврсто да се држат заедно за да можат зеднички да го решат проблемот кој ги засегнува. Ако сте слободни, излегувањето со една важна или многу драга личност предвидува дека вашите замисли комплетно ќе се реализираат. Бидете фини, складни и недостижни во конверзацијата, бидејќи само така ќе оставите добар впечаток.\n Здравје \n\nВодете повеќе сметка за здравјето и бидете посмирени, само така ќе ги избегните пречките со срцето.");
            f2.setMesecen("Мај 2014 Работа: Прво што би требало да направите е да тргнете со решавање на работните обврски со кои доцните. Дури откако ќе ги завршите тие работи можете да им се препуштите на понатамошните цели. Јасно размислувате, сигурни сте во себе, знаете што е потребно да се преземе за да бидете поуспешни. Кон средината од месецот поволни се условите за добивање вработување. Љубов: Од почетокот на мај ве следи убаво влијание на поле на љубовта. Во вашето соѕвездие ќе биде владетелот на астролошкото поле на љубовта. На добар пат сте да дојдете до емотивна врска која во многу нешта ќе ве исполни. Кога ќе ви се појави интересна личност, бидете сигурни дека набргу ќе се појави уште некој. При секој контакт најважна е комуникацијата. Ако тука се усогласите, можете да очекувате успешна врска во која нема да има монотонија. Преку пријатели или роднини може да запознаете една помлада, но успешна личност. Ќе добиете покана за заедничко патување или ќе одите во посета на партнер кој живее во странство. Одењето кај роднини во странство исто така ви дава можност за нешто ново. Сите оние кои планирале смирување ќе мора да се прилагодат кон тоа. Кон крајот на мај се очекуваат подобри промени, тогаш Венера влегува во вашето соѕвездие.Здравје: Сонцето во вашето соѕвездие ви донесува оптимизам и добро здравје.");
            f2.setGodisen("2014 Тврдоглави, но трпеливи, Биковите оваа година ќе бидат подготвени за секоја олуја која ќе ја доживеат. Првиот дел од годината ќе ви донесе борба за работа и пари, додека здравствените проблеми ќе ви создаваат конфузија во текот на целата година. Добрата вест е што љубовта и интимноста ќе ги одржувате на одлично ниво, па ќе имате безрезервна поддршка.");
        }

        private void Bliznacislika_Click(object sender, EventArgs e)
        {
            Bliznacislika.BorderStyle = BorderStyle.Fixed3D;
            bliznacilbl.BackColor = Color.Orchid;

            Form2 f2 = new Form2();
            f2.Visible = true;
            f2.Activate();
            f2.SetDesktopLocation(x, y);

            f2.setDneven("Можностите за работен успех и професионален напредок денес ви се исклучително поволни, само треба да најдете најдобар начин да ги искористите. Ако сте амбициозни и имате силен волја и јака дисциплина успехот ви е загарантиран. Со партнерот и пријателите добро ќе се разбирате. Интуицијата ви е нагласена ќе бидете отворени за комуникација со луѓето, а покрај тоа ќе имате и доволно сила и енергија да ги елиминирате сите препреки.");
            f2.SetZnak("БЛИЗНАЦИ\n(21.05 – 20.06)");
            f2.setNedelen("Работа \nПрекрасно се чуствувате, задоволни сте, а причината е индивидуална. Некои претставници очекуваат деловна експанзија, некои се во нов интересен проект, а пак некои започнуваат со бизнис. Бидејќи периодот е поволен, препуштете се на ваш својствен начин. Ведрината во вас ви дава сила целосно да се посветите на работата, но и задоволството со кое оди бидејќи и финансиите ќе ви се подобрат. Мала нервоза е нормална состојба, бидејќи почесто сте под стрес било тоа да е работен или пак семеен. Ќе бидете во форма и за сите видови интелектуални активности. Искористете го периодот за учење.\n Љубов\nВашата љубовна врска се продлабочува, а вие станувате свесни за досега скриени ситници. Во однос на партнерот подгответе некое изненадување и внесете повеќе креативност. Родените во Јуни особено ќе бидат емотивно напнати и експлозивни. Можеби ќе завршите некои љубовни приказни или нерасчистени роднински сметки.\nЗдравје\nДобро, можни се повреди при работата, внимавајте на вратот.");
            f2.setMesecen("Мај 2014 Работа: Упорноста, трпеливоста и енергичноста во текот на мај ќе ви донесат трајни деловни решенија и ќе ви овозможат подобар статус. Смислата за практичност потполно ќе се докаже. За се да биде вака успешно, потребна е одмереност и скромност. Ако сте заинтересирани само за работа која ве исполнува и пребирате, слаби ви се шансите тоа да го остварите. Љубов: Односите во бракот или врските може да бидат многу тензични. Претерувањето во очекувањата од страна на партнерот, љубомората и спротивните ставови меѓу партнерот се причина за овие случувања. Искрениот однос и разговорот без замерки и префрлања, без враќање на старите проблеми може да ги смири односите. Како што ќе одминува мај поголеми се шансите за усогласување. Ова не е добар период ниту за обновување на врската. Некое подобро влијание може да се очекува во втората половина од месецот. На почетокот од мај може да дојде до романтична врска на работното место. Поголемиот дел од мај ќе го обележат нови познанства до кои ќе дојде преку пријатели, во нивно друштво, но и едно убаво пријателство може да прерасне во емотивна врска. Склони сте кон брзи промени и ненадејни влегувања во врска. Тоа може да води кон нови силни интереси кои ќе поминат веќе при втората или третата средба. Здравје: Мај ви донесува добро здравје. Водете повеќе сметка за себе.");
            f2.setGodisen("2014 Близнаците се познати по тоа што постојано го менуваат своето мислење, но оваа година нема да имаат многу простор за дискусија. Годишниот хороскоп за 2014та открива дека ќе имате мали кризи на работното место, најчесто врзани со вашата финансиска ситуација. Вашиот љубовен живот ќе биде на нормално ниво и нема да посакувате значајни промени, додека околу здравјето ќе треба да се потрудите малку повеќе.");
        }

        private void Devicaslika_Click(object sender, EventArgs e)
        {
            Devicaslika.BorderStyle = BorderStyle.Fixed3D;
            devicalbl.BackColor = Color.Orchid;
            Form2 f2 = new Form2();
            f2.Visible = true;
            f2.Activate();
            f2.SetDesktopLocation(x, y);


            f2.setDneven("Ќе имате многу контаки, средби и сето тоа целосно ќе делува врз вашато расположение. Ќе имате множност за некоја промена што со задоволство ќе ја прифатите надевајќи се на поголема заработувачка. И нема да згрешите. Некои ќе имаат проблеми во врските особено со партнерот. Потрудте се да промените нешто на вашиот надворешен изглед. Здравјето добро ве служи.");
            f2.SetZnak("ДЕВИЦА\n(23.08 – 22.09)");
            f2.setNedelen("Работа \n Неделава би било добро да се држите само на сигурните деловни стази и проверените контакти. Не бидете премногу сигурни во новите пријателства и не му се доверувајте секому. Некои од вас ќе се впуштат во нови деловни авантури и експерименти, но ве советуваме да бидете претпазливи во секој момент. Ќе ви се овозможи прилика за кратка осаменост, но не претерувајте во тоа. Ќе наидете на препреки во работењето доколку се занимавате со инателектуална работа. Бидете внимателни во вложувањето во ризични ситуации, бидејќи можете да дојдете до големи финансиски загуби.\nЉубов\nЌе успеете да ги спречите љубовните проблеми, односно губење на личноста во која сте вљубени. Вашата љубов ќе ја дарувате на саканото лице. Ќе бидете многу интересни во друштво, а во слободното време ќе бидете опкружени со вашите пријатели. Потикнати од љубовта, среќни и расположени ќе работите одлично и ќе имате резултати подобри од очекуваните.\nЗдравје\nНа вашиот организам му требаат витамини.");
            f2.setMesecen("Мај 2014  Работа: Својата одмереност во мај квалитетно ќе ја покажете. Сè што ви се случува, било да е добро или не, детално ќе го анализирате и дури кога ќе дојдете до прифатливо решение ќе тргнете кон реализација на истото. Првата половина од мај е добра за подготовки, анализи и одлуки, за во втората половина на мај да дојде до нивна реализација. Незабележано ќе дојдете во прв план. Љубов: Во текот на мај ќе биде актуелно минатото во секоја смисла. Љубовта која долго траела, а при тоа дошло до раздвојување и тоа одамна, може да се обнови. Всушност вашето трпение сега донесува убаво продолжение на приказната. Ова е судбоносна љубов, па немојте да се борите самите со себе. Препуштете партнерот да ве води, ако кај вас постои и најмал отпор... и понатаму живее таа огромна љубов во вас. Врските кои биле пократки од една година, сè уште не се во добар период за смирување. Дури кон крајот од месецот може да дојде до некое поместување помеѓу вас. Слободните главно ќе среќаваат партнери и симпатии од минатото. Тоа би можело да се случи на пат, но и преку интернет, роднини и пријатели. Одлична хармонија ќе постигнете со Јарец или Бик. Ве привлекуваат доминантни и по малку таинствени личности. Љубовта со личност од странство со време ќе стане сè поинтересна. Здравје: Добро се чувствувате и физички и духовно. Одмерени сте во сè што работите, грижливо водите сметка за своето здравје.");
            f2.setGodisen("2014 Стабилноста е секогаш добредојдена за Девиците. Годишниот хороскоп за 2014та година покажува дека ќе го достигнете максимумот на многу полиња. Сè ќе биде лесно и по ваша желба, па затоа ќе ви недостасуваат авантурите. Но, сепак ќе се помирите дека едноставноста е добра работа. Концентрирајте се на кариерата, но балансирајте со сопствените задоволства.");
        }

        private void Jarecslika_Click(object sender, EventArgs e)
        {
            Jarecslika.BorderStyle = BorderStyle.Fixed3D;
            jareclbl.BackColor = Color.Orchid;
            Form2 f2 = new Form2();
            f2.Visible = true;
            f2.Activate();
            f2.SetDesktopLocation(x, y);

            f2.setDneven("Ве советуваме да бидете што поотворени спрема другите луѓе, особено спрема оние кои многу ви се важни. Ако нешто не ве остава на мир или поради нешто сте нерасположени, сега е вистински момент да промените нешто. Ова е одличен ден за проучување и самоанализа. Сите обиди да постигнете подлабока хармонија ќе ви бидат доста успешни. Па вреди да се обидете. Здравје: главоболки и нервоза.");
            f2.SetZnak("ЈАРЕЦ\n(22.12 – 19.01)");
            f2.setNedelen("Работа: Чуствувате минлива напнатост, но сепак ќе бидете мирни, а расположението ви се враќа. Дозволете си себе си повеќе време, негувајте го својот изглед. На некои од вас ќе му се исполни некоја стара желба. Односите на работното место не се онакви какви што посакувате, но треба да знаете дека не треба постојано да се наметнуавте со своите ставови. На финансиски план нема да дојде до некои поголеми промени, но внимавајте некоја непромислена одлука од ваша страна да не предизвика непланирани трошоци. Љубов: Во љубовта ќе морате поотворено да разговарате со вашиот партнер ако сакате да ги избегнете недоразбирањата. Обидетет се, ќе бидете изненадени од тоа колку вашиот партнер има разбирање за вас. Оние кои се во брак на некој начин ќе се обидат да ја избалансираат врската со партнерот. Но од него треба да очекувате онолку колку што сте спремни да дадете. Слободните претставници ги очекува опасен предизвик. Здравје: Проблеми со крвниот притисок.");
            f2.setMesecen("Мај 2014 Работа: Нема да си дозволите да ги повторите старите грешки. Еден пропуст од минатото многу ве чинел. Иако одите побавно, сигурни сте во себе и своите цели. Личност со која долго работите и соработувате ќе ви биде од голема помош во текот на мај. Слушајте се исклучиво себеси, така ќе се заштитите од несакани случувања. Љубов: Почетокот на мај најавува влегување во заеднички живот со партнерот, додека во бракот се случуваат убави новости. Можна е и долго очекувана бременост или пак бебето ќе си дојде дома. Ако подолг период сте раздвоени од партнерот со кого сте биле во врска повеќе од една година, пријателите ви подготвуваат убаво изненадување. Со нивна добра организација, повторно ќе стапите во контакт. Ви беше потребен контакт за да се уверите во своите чувства. Мај е добар за сите смирувања. До нова љубов главно ќе дојде на домашни забави, во комшии... На пријателите со кои често се гледате, во посета ќе им дојде роднина од странство или од друг град. Дружењето ќе ви биде пријатно, а љубовта е на повидок. Кон средината од месецот може да бидете раздразливи и склони кон кавга. Тоа може да ви донесе препирки и пократко раздвојување. Во тој период ви се препорачува да не влегувате во емотивна врска, лесно може да го уништите она што би можело да биде убаво. Здравје: Поголемо внимание посветете му на начинот на исхрана. Со својата волја и упорност можете да ги промените лошите навики.");
            f2.setGodisen("2014 Во светот на Јарците, независноста е клучен збор. Вие знаете што сакате и имате многу малку трпение пред тоа и да го добиете.Оваа година ќе може да си дозволите мал одмор од борбите, затоа што годишниот хороскоп за 2014 година покажува дека ќе го достигнете успехот во кој вложувате веќе подолго време. Можеби ќе чувствувате друштвен притисок заради желбата да поминете квалитетно време сами со себе, па затоа потрудете се да ги избалансирате и двете страни.Уживајте во времето кое ќе го одвоите за себе, но уживајте и во дружбата, затоа што само така ќе создадете позитивна атмосфера и мир.");
        }

        private void Lavslika_Click(object sender, EventArgs e)
        {
            Lavslika.BorderStyle = BorderStyle.Fixed3D;
            lavlbl.BackColor = Color.Orchid;
            Form2 f2 = new Form2();
            f2.Visible = true;
            f2.Activate();
            f2.SetDesktopLocation(x, y);

            f2.setDneven("Ќе ви излезат некои непланирани работи на професионален план. Тоа од вас ќе бара многу енергија и трпение. Но не очајувајте, ве очекава награда од претпоставените. Можни се некои помали финансиски издатоци. Што се однесува до љубовта се е во најдобар ред, за оние кои се во брак и оние претставници во подолгите љубовни врски. Здраствената сотојба ви е одлична, само што ви треба малку релаксација.");
            f2.SetZnak("ЛАВ\n(23.07 - 22.08)");
            f2.setNedelen("Работа:Работите не можат да чекаат. Доколку нешто сте пропуштиле неделава тоа мора да го надополните. Ќе бидете во некоја занесеност, а тоа ќе ви биде и главна мотивација за сите ваши активности. Меѓутоа во овој период ќе морате со повеќе внимание да му се посветите на професионалните барања.	Многу е важно со кој влегувате во работа. Одбирајте ги деловните партнери и соработници. Занимавањето со креативна работа и правилното користење на енергијата ќе ви донесе конкретни резултати. Ве очекуваат финансиски потешкотии кои успешно ќе ги разрешите. Љубов:Многу ќе ве нрвира тоа што некои сакаат да се мешаат во вашиот приватен живот. Ќе бидете под притисок да постапите на одреден начин, а во вас се јавува отпор и желба за слобода. Родените во третата декада ќе имате убаво љубовно доживување и продлабочување на односите во вашата врска.Здравје:Здраствената состојба ви е доста чуствителна, внимавајте на крвниот притисок.");
            f2.setMesecen("Мај 2014 Работа: Долго ќе го помните мај по деловните остварувања и успеси. Повеќето од вас и се потполно посветени на кариерата, подготвени во секој момент да се докажуваат, истакнуваат... Ако во претходниот период сте направиле некој пропуст, грешка, сте испуштиле добра прилика...успешно ќе ја надминете дадената ситуација. Ослонете се исклучиво на себе и успехот ќе дојде. На повидок е вработување. Љубов: Во текот на мај ќе бидат актуелни смирувања помеѓу партнерите кои се заедно неколку месеци или една година. Можеби ви било потребно да се разделите извесно време за да препознаете дека во дадениот момент сте ја нашле вистинската личност, а за тоа не сте биле свесни. Ако саканата личност била долго време отсутна, дали поради работа во странство или било кои други објективни причини, најпосле доаѓа до повторна средба. Слободните ќе бидат повеќе заинтересирани за повозрасни партнери или се во потрага за сериозна врска. Ако бидете упорни, ќе успеете во тоа. Спонтано може да влезете во врска со зафатена личност со која ви поаѓа да остварите некоја важна животна цел. Тука се разбира се и тајните врски. Ако сте веќе во таква врска, сите ѕвезди ви се наклонети, вашата љубов ќе биде сè посилна. Разведен партнер може да ви донесе многу среќа. Бидете внимателни ако се одлучите за некој Овен. Здравје: Ако веќе сте направиле поголеми измени во начинот на живеење, секој ден ќе се чувствувате сè подобро.");
            f2.setGodisen("2014 Лавови, ќе има на што да бидете горди оваа година! Напорно работите, па во 2014та конечно ќе ги добиете наградите кои ги заслужувате. Ќе ви се отворат нови можности, луѓето ќе ја забележат вашата генијалност, а може и да добиете нова работна понуда за промена на кариерата. Но, не заборавајте дека покрај работните квалитети имате и блиски луѓе и односи. Одржувајте ја рамнотежата во животот!");
            
        }

        private void Ovenslika_Click(object sender, EventArgs e)
        {
            Ovenslika.BorderStyle = BorderStyle.Fixed3D;
            ovenlbl.BackColor = Color.Orchid;
            
            Form2 f2 = new Form2();
            f2.Visible = true;
            f2.Activate();
            f2.SetDesktopLocation(x, y);

            f2.setDneven("Ги обожавате моментите поминати со семејството, но тие денес ќе ви будат помешани чувства. Во еден момент домот ќе ви биде преполн со разбирање и хармонија, но веќе во следниот ќе започнувате војна со зборови. Тајната е во трпеливоста.До вашите уши ќе стигне комплимент кој значително ќе ви ја зголеми самодовербата и ќе добиете силен сјај во очите.");
            f2.SetZnak("ОВЕН\n(21.03 – 19.04)");
            f2.setNedelen("Работа\nМислењето на другите неделава многу ќе делува врз вас. Можеби ќе се нервирате и ќе се карате поради плеткањето на другите во вашиот живот, но подобро е да се смирите и убаво размислете кого ќе го слушате, а кого ќе го игнорирате. Не обрнувајте внимание на ситните озборувања и подметнувања на работното место, бидејќи ги има доста, дури и оние кои ве сакаат и ви мислат само добро. Имате доста тешкотии и ќе морате да се откажите од нешто, но внимавајте од што. Вашата потреба за акција може да ви донесе и здраствени пречки.\nЉубов\nЕдноставно како да не ќе можете да престигните да посветите доволно внимание на вашиот партнер, па затоа можни се и некои расправии. Бидете повеќе внимателни во односот со него, а ако повеќе време не сте задоволни од врската ставете точка и расчистете. Слободните ги очекува љубов на прв поглед која ќе ви донесе убави моменти.\nЗдравје\nПроблеми со несоница и главоболки.");
            f2.setMesecen("Мај 2014 Работа: Мај ви донесува оптимизам и насоченост кон парите. Се будат нови идеи и планови. Сè она што ви е важно планирајте го и подготвувајте го до половината на мај за потоа да дојде до конкретни случувања. Втората половина на мај ви носи можност за патување и добри промени и тоа со поддршка на пријателите и блиски роднини. Појасно размислувате. Поголем прилив на пари. Љубов: Во текот на мај во вашето соѕвездие ќе борави Венера. Самото нејзино присуство најавува добри љубовни случувања, повеќе сте свртени кон дружење, нова љубов и убави промени. Финансиската ситуација нема да ви преставува проблем така што ќе имате можност да се дотерувате, купувате убави работи и да излегувате. На почетокот од месецот на семејна прослава може да запознаете личност која не живее во вашето место. Понатамошниот тек на приказната зависи од комуникацијата што ќе ја остварите. Иницијативата препуштете му ја на партнерот, што за вас ќе биде тешко, но успешно. Ќе се појави и партнер кој е во лош однос со партнерката. Постои голема привлечност меѓу вас. Мај ќе ви пружи повеќе можности за влегување во врска и тоа со личности кои умеат да ве заинтересираат и да ве придвижат. Здравје: Здравјето и расположението ви се добри. Во втората половина на месецот ќе бидете чувствителни на вируси.");
            f2.setGodisen("2014   Оваа 2014 година ќе биде многу возбудлива година за родените во знакот на Овен. Во последните неколку години Овенот се бори на многу полиња. Годишниот хороскоп, продолжува да покажува напредок, како и можност, целиот напор  во 2014 година конечно да се исплати. Значајна година за кариера и финансии, како и позитивна внатрешна мотивација. Поработете малку повеќе во некои области кои излегле од рамнотежа. Мора да обрнете поголемо внимание на балансот.");
        }

        private void Rakslika_Click(object sender, EventArgs e)
        {
            Rakslika.BorderStyle = BorderStyle.Fixed3D;
            raklbl.BackColor = Color.Orchid;
            Form2 f2 = new Form2();
            f2.Visible = true;
            f2.Activate();
            f2.SetDesktopLocation(x, y);

            f2.setDneven("Ве очекува разврска на емотивното поле. Денов е добар и за нови почетоци во љубовта , па соберете храброст и пријдете му на личноста која ве привлекува. Што се однесува до деловното поле тука постои можност за потпишување на договори, трговски зделки или пак можеби некое пократко патување. Не претреувајте во трошењето на парите и помислете на тоа како ги заработувате. Здравје: главоболки.");
            f2.SetZnak("РАК\n(21.06 – 22.07)");
            f2.setNedelen("Работа:Нервите ви се при крај и со некој свој непромислен потег или дрскост можете да привлечете внимание кај другите. Потрудете се да го намалите отпорот од околината, со ароганција само се зголемува. Време е да завртите нов лист и да го напуштите сето тоа што ве оптеретувало веќе подолго време. Ќе се чуствувате подготвени да тргнете понатаму што ќе ви донесе подобрување во вашата психичка состојба. Подгответе се за нови и возбудливи настани кои ќе ги има доста.Немојте да барате помош од страна бидејќи таа може да биде недобронамерна или некритична. Љубов:Ако сте во сериозна врска овој период е важен за нејзината иднина. Слободните би можеле да започнат нова љубовна приказна, некој ќе превземе се за да ве освои. Брачните врски се под добро влијание на планетите, па затоа можеби ќе размислувате за проширување на вашето семејство. Во кругот на семејството се чуствувате среќно и за да остане тоа така ќе мора повеќе време да останувате во него.Здравје:Mожни се проблеми со желудникот. Намалете со храната.");
            f2.setMesecen("Мај 2014Работа: Раковите имаат силна потреба за докажување на морален начин. Тежнеат да остварат добри односи со соработниците. На таков начин очекувајте сестрана поддршка и протекција. Лесно можете да дојдете до вработување или поминување на подобро работно место. Ексцентричноста, несигурноста и недовербата ќе ви донесат сигурна загуба.Љубов: Силната енергија која ја чувствувате може да придвижи исклучителна тврдоглавост и бунт во бракот и врските. Сето тоа ќе зајакне ако некој од партнерите доживува силен притисок од страна на семејството. Насочете ја енергијата позитивно и одлучете што ви е поважно. Инаку ќе бидете губитник. Трпеливоста и упорноста најпосле ќе ви овозможат да дојдете во контакт со бившиот партнер. До смирување ќе дојде ако успеете да се прилагодите, воспоставите добра комуникација и ако го одржите ветувањето кое сте го дале. Мај ви донесува нова љубов со стабилен или постар партнер. Повеќе сте заинтересирани за сериозна врска отколку за авантура, а ќе има и убава љубовна приказна со странство. Имате поголеми можности за остварување на нови врски и тоа преку работата со која се занимавате. Партнерот е презафатен и кај него се случува постојано нешто ново. Ако успеете да се прилагодите на бурните случувања во животот на партнерот, ќе имате успешна врска.Здравје: Оптимизмот и задоволството ќе ве следат во поголемиот дел од месецот. Само немојте да претерувате ниту со јадење, ниту со физички активности.");
            f2.setGodisen("2014   Ова е возбудливо време за Раковите! Годишниот хороскоп за 2014 покажува дека животот ќе биде преполн со мистерии и интриги за пречувствителните Ракови. Иако работите ќе се случуваат побавно отколку што очекувате, сепак тие ќе ви донесат интерес за учење, креативност и многу нови можности.");
        }

        private void Ribislika_Click(object sender, EventArgs e)
        {
            Ribislika.BorderStyle = BorderStyle.Fixed3D;
            ribilbl.BackColor = Color.Orchid;
            Form2 f2 = new Form2();
            f2.Visible = true;
            f2.Activate();
            f2.SetDesktopLocation(x, y);

            f2.setDneven("Сентиментално сте расположени, пристапни не само за туѓи проблеми туку и за туѓите расположенија. Па затоа одбирајте поведри луѓе, смеете се и радувајте се бидејќи тоа е вистинскиот лек за вашата душа. Луѓето со негативна енергија одбегнувајте ги -само можат да ви штетат. Смирете се шетајте во природа и најважно од се наспиете се добро.");
            f2.SetZnak("РИБИ\n(19.02 – 20.03)");
            f2.setNedelen("Работа:Ќе бидете почуствителни од обично. Односите со околината ви се отежнати. Премногу сте горди за да прозборите за вашите проблеми и не сакате да се соочите со работниот неуспех. Сепак секоја ситуација делува корисно. Ослободете се од погрешни навики и прифатете ги зборовите од другите како добар патоказ за понатаму. Премногу темпераментно делувате во ситуациите за кои вашата околина или сакана личност има поинакво гледање и решение. Кај некои Риби постои можност за контакти или настапи во медијумите. Би било добро вашето внимание да го свртите кон нешто кртеативно, популарноста на тоа поле би била поголема. Љубов:Во љубовната врска во која се наоѓате владее една слична состојба. Па размислете и одлучете што сакате и што очекувате од вашиот партнер, а истото важи и за оние кои се во брак. Слободните претставници на овој знак ќе ги загрижува тоа што се сами. Здравје:Сеуште добро се чувствувате, но сепак посветите малку повеќе внимание на вашата здравствена состојба.");
            f2.setMesecen("Мај 2014 Работа: Венера во вашето соѕвездие одлично ви делува. Јасно ја водите својата деловна ситуација и сега знаете каде се пронаоѓате, а каде не. Во првата половина од мај овозможен ви е подобар контакт со претпоставените. Би можеле успешно да се дополните во заедничките цели. Ако сте во тајна врска со колега, од него ќе имате огромна поддршка. Венера ви најавува добар прилив на пари. Љубов: Во вашето срце сè уште живее старата љубов. Мај ви носи многу љубовни решенија, па и смирувања. Особено во врски кои неодамна се прекинати. Вам ви останува и понатаму да мирувате, самите околности ќе ве доведат на истиот животен пат. Средбата взаемно ги враќа бурните емоции. Ако и понатаму се држите на дистанца, немојте да се надевате на убави промени. Една постара личност повторно се враќа во вашиот живот. Можеби по подолг период се враќа од странство. Може да очекувате убав почеток кој наскоро ќе ви донесе патување. На некоја забава лесно може да дојдете во ситуација да бирате помеѓу две личности. Едната е помлада, младолика, додека другата е зафатена и исклучително успешна. Прифатете ја секоја покана за прослава каде може да запознаете еден успешен спортист или униформирана личност. Кон крајот од месецот бидете внимателни во односите со партнерот. Ако на било кој начин го запоставите, ќе предизвикате бурно незадоволство, можеби и раскинување. Здравје: На почетокот од месецот чувствителна ви е главата и органите на главата. Можни се минливи главоболки.");
            f2.setGodisen("2014 Годишниот хороскоп за 2014 година покажува голем успех кога се во прашање сите полиња освен меѓучовечките односи. Кариерата, парите и желбата да учите и да ги развивате своите способности ќе ја обележи првата половина од годината. Во другата половина на 2014 - та ќе биде потребно да вложите поголеми напори и труд за да ги држите работите под контрола. Но, тоа е во ред. Рибите никогаш не се плашат од работа. Кога станува збор за меѓучовечките односи, Рибите во 2014 година ќе имаат малку повеќе предизвици. Многу прашања ќе бараат да одвоите повеќе време за да ги разберете и да ги решите. Добрата вест е тоа што умеете да сфатите дека пречките и тешкотиите се предизвици кои ќе ве направат посилни и подобри. Чувствителни, но борбени, личностите родени во знакот на Риби ќе дочекаат мир во 2014 година.");
        }

        private void Skorpijaslika_Click(object sender, EventArgs e)
        {
            Skorpijaslika.BorderStyle = BorderStyle.Fixed3D;
            skorpijalbl.BackColor = Color.Orchid;
            Form2 f2 = new Form2();
            f2.Visible = true;
            f2.Activate();
            f2.SetDesktopLocation(x, y);

            f2.setDneven("Некои работи ќе ве прават доста немирни и ќе ви создаваат фрустрации, но ќе имате и причини за задоволство. Ќе имате добри контакти со важни луѓе, а некои ќе се обидат да ви помогнат, па затоа е многу важно да можете да ги препознаете добрите намери. Финансиската ситуација ви е одлична. А односите со пријателите доста ладни. Ќе бидете многу приврзани кон партнерот. Внимавајте од повреди.");
            f2.SetZnak("СКОРПИЈА\n(23.10 – 21.11)");
            f2.setNedelen("Работа:Надворешните прилики ќе бидат завртени против вас. Иако проблемите воглавно ќе бидат обијективни, од деловна природа, вашата приватна сфера ќе трпи. Искористете го моментот бидејќи само со одлучна акција ќе го решите порблемот. Доколку ги вербализирате и тактизирате работите, би можеле да пропуштите одлична прилика. Растргнати сте помеѓу желбите и можностите. Не ви е лесно, но ќе мора да бидете трпеливи. Ќе успеете да го реализирате тоа што сте го наумиле, бидејќи не се откажувате така лесно.  Љубов:Во семејните и љубовните односи бидете попустливи, па дури и ако знаете дека сте во право. Потребна ви е поддршката и разбирањето од другите. Пронајдете алтернативен пат. Во овој момент успехот и тешкотиите се нераскинливо поврзани. Ако сте слободни приликите за нова врска се поволни, но внимавајте вашето однесување да не ви ги расипе плановите.Здравје: Здравствената состојба неделава ќе ви биде задоволителна.");
            f2.setMesecen("Мај 2014 Работа: Секоја упорност и трпение во текот на мај ви носи стабилност на работното место. Можно е да добиете вработување во струката или да почнете работа која уживате да ја работите. Скорпиите се во еден од подобрите периоди кога ги очекуваат подобри деловни решенија. Ќе постигнете поголема популарност на деловен план, а тоа ќе  резултира и со подобрување на финансиската ситуација. Љубов: Познанствата до кои дошло во текот на минатиот месец, во почетокот од мај ќе се претворат во љубовна врска. Додека ги завршувате секојдневните обврски, можеби некому пружате помош која му е неопходна. Ќе дојдете во контакт со униформирана личност. Контактите продолжуваат за наскоро да добиете повик за излегување. Мај главно ќе ви донесува љубов која во моментот се случува. Сè се случува брзо така што лесно може да згрешите во процената на партнерот. Некаде длабоко во вас постои некој вид љубопитност да испробате љубов со личност која ќе ве заинтересира уште на првата средба. Авантурите ви носат некој вид задоволство и потреба за докажување. Токму низ вакви минливи авантури може да запознаете личност во која силно ќе се вљубите. Ако и понатаму сакате смирување ќе дојдете до тоа ако успеете да се усогласите со партнерот да не ги повторите старите грешки... инаку смирувањето кратко ќе трае. Здравје: Само ви е потребно повеќе одмор и сон за да не ви се намали концентрацијата. Тогаш би можело да дојде до помала повреда.");
            f2.setGodisen("2014 Одлучни сте работите да се одвиваат онака како што сте замислиле. Ако не биде така, ќе се смешкате од страна, а ќе вриете во себе, додека не го решите проблемот.Годишниот хороскоп за Скорпија во 2014 година покажува дека оваа година ќе ви пружи многу задоволства. Работите навистина ќе ви одат од рака, посебно во поглед на врските и кариерата. Насмевка на лицето и уживајте во 2014 година");
        }

        private void Strelecslika_Click(object sender, EventArgs e)
        {
            Strelecslika.BorderStyle = BorderStyle.Fixed3D;
            streleclbl.BackColor = Color.Orchid;
            Form2 f2 = new Form2();
            f2.Visible = true;
            f2.Activate();
            f2.SetDesktopLocation(x, y);

            f2.setDneven("Би било идеално ако можете денска потполно да се посветите на работниот живот. Морате да заборавите на се што ве измачува и потполно да му се посветите на работата. Иако на почеток нема да видите резулатати сепак издржете и не се разочарувајте. Љубовните проблеми заборавете ги накратко и работете. Финансиската ситуација ќе биде малку подобра. Не го занемарувајте здравјето.");
            f2.SetZnak("СТРЕЛЕЦ\n(22.11 – 21.12)");
            f2.setNedelen("Работа:Внимавајте да не ја трошите енергијата на непотребни работи. Не делувајте многу емотивно на евентуалните закаснувања или препреки и не размислувајте за неважни работи кои се надвор од доменот на вашата работа. Ќе ви бидат нагласени духовните особини. Ќе барате друштво на луѓе со кои делите политички или религиозни ставови, уметнички или образовни интереси. Ќе имате доволно време и да се посветите на секојдневните активности. Ако планирате да започнете нов проект, не двоумете се, ве очекува успех и поддршка од соработниците. Љубов: Емотивниот живот се стабилизира и покрај разнишана самодоверба. Ако имате партнер можете да го искористите овој момент за обновување на чуствата, па за тоа можете да организирате романтична средба која долго ќе остане во вашите сеќавања. Ако сте и понатаму незадоволни во љубовта променете нешто но не бегајте од проблемите. Здравје: Можеби ќе бидете малку нервозни, но одморот ќе биде вистински лек за тоа.");
            f2.setMesecen("Мај 2014 Работа: Стрелците се сигурни во себе, знаат што сакаат. Веќе се наоѓате во период кој ви носи деловен оптимизам. Мај ви овозможува убави нови можности. Кога излегувате во слободно време ќе остварите важни контакти  ќе добиете важни информации, што ќе ви овозможи полесно остварување на деловните цели. Успех преку странство и сите работи ќе ги извршувате со задоволство. Ќе има и пари. Љубов: На почетокот од месецот во вашето астролошко поле влегува Венера. Самото нејзино присуство укажува на потреба од излегување, почеток на нови љубовни приказни. На спонтан начин ќе свртите внимание кон себе и ќе привлечете погледи од спротивниот пол. Овој месец ќе биде многу бурен. Покрај новата љубов, ќе има и кратки прекини, а обновувањето на врската ќе зависи само од вас. Ако сакате да се смирите мора да бидете сигурни во себе, немојте да се повлекувате. Вашата позитивна енергија поволно делува на бившиот партнер. До кратки раскинувања може да дојде кон средината од месецот. Ако го сакате партнерот, немојте да прифаќате изговори кои ве водат кон нови кавги. Новата љубов на почетокот од месецот ќе тргне на ваш начин. Ако партнерот има премногу барања, тоа сигурно нема да ви годи. Не влегувајте во подлабок контакт, тоа сепак не е личност за вас. За сега не ви се препорачува да влегувате во емотивна врска со блиски пријатели. Подобрата финансиска ситуација поволно влијае на односите во бракот.Здравје: Помала вознемиреност може да ве мачи на почетокот од месецот. Начинот на исхрана влијае на вашето расположение и здравје.");
            f2.setGodisen("2014 Годишниот хороскоп за Стрелец во 2014 година покажува дека оваа година е полна со ведрина. Иако ќе има и успеси и падови, општиот позитивен став на Стрелецот ќе ги држи работите под контрола. Ако не оди секогаш сè како што треба, не се плашете да побарате помош од оние кои имаат искуство и може да ви помогнат. Искуството е најбрз начин за да научите. Кога се соочувате со неволји кои се можни во 2014 година, бидете подготвени да учите од нив и да напредувате. На тој начин ќе имате можност да се менувате и да растете како личност.");
        }

        private void Vagaslika_Click(object sender, EventArgs e)
        {
            Vagaslika.BorderStyle = BorderStyle.Fixed3D;
            vagalbl.BackColor = Color.Orchid;
            Form2 f2 = new Form2();
            f2.Visible = true;
            f2.Activate();
            f2.SetDesktopLocation(x, y);

            f2.setDneven("Извршувањето на работните задачи ќе ви одземе поголем дел од денот, а слободно време ќе имате малку. Побарајте помош ако ви е потребна. Односите со партнерот ви се на добро ниво, особено ако е личност родена во вашиот знак. Слободните претставници на овој знак ќе доживеат лошо искуство со некој додворувач. Здравствената состојба е добра, сепак повеќе треба да одмарате.");
            f2.SetZnak("ВАГА\n(23.09 – 22.10)");
            f2.setNedelen("Работа:Премногу се оптроварувате со работи кои во овој момент не ви се достапни. Тоа кај вас предизвикува нервоза. Со тоа не само што можете да ги пореметите односите во средината во која живееете и работите, туки и себе си да си предизвикате здравствени проблеми. Паметно испланирајте ги и реализирајте ги вашите деловни акции. Совладајте ја нервозата и ќе ја спречите главоболката. Не се двоумете туку веднаш изберете некој од колегите кој може да ви помогне и разработете ја работата по етали. Само на таков начин очекувајте дека ќе имате успех. Поставувате свои услови и брзо ќе забележите дека и другите ги прифаќаат. Љубов:Ве очекува пријатно изненадување во вашето семејство. Конечно ќе ви успее да ги погодите намерите на вашиот партнер, кои ќе бидат нешто сосема друго од она што сте го очекувале на почетокот. Ќе забележите дека некој посебно се интересира за вас. Здравје: Здраствената состојба ви е чуствителна-ве очекуваат главоболки.");
            f2.setMesecen("Мај 2014 Работа: На деловен план ѕвездите максимално ве поддржуваат во текот на мај. На почетокот од месецот го довршувате она што сте го работеле за да бидете подготвени за нешто ново и многу подобро за вас. Ако упорно сте работеле на некој деловен план, мај ви носи трајни позитивни решенија. Сите овие влијанија ги потврдува и подобрата финансиска состојба. Љубов: Ако чувствувате големо незадоволство во врската или бракот, првенствено добро размислете како сте се довеле во таква состојба. Потребна ви е промена, некое освежување кое ќе ви ја врати радоста. Тоа се случува поради силната енергија која ја чувствувате. Ви останува само да се свртите кон позитивното размислување, поубавите случувања и конечно повторно ќе бидете свои. Вие се менувате без да се обидете да го смените партнерот. Ако се двоумите во врска со бивша љубов која траела неколку месеци, сега за сега немојте да се обидувате ништо да правите. Времето ќе ви донесе одговори. Подобри случувања ве очекуваат во вториот дел од месецот. Осамените личности се многу пребирливи и неодлучни. Незабележано би можеле да влезат во врска со романтичен партнер кој се занимава со своите таленти. Еден службен пат ќе придвижи нов љубовен почеток. Во секоја смисла странство ќе ви овозможи убава љубовна приказна. Здравје: Може да имате проблеми со алергии. Не ви се препорачува да претерувате со пијалак.");
            f2.setGodisen("2014 Кај Вагите стабилноста и рамнотежата се многу важни. Годишниот хороскоп за Вага во 2014 година покажува дека ова ќе биде голема година, бидејќи носи многу нешта. Тоа ќе ги инспирира Вагите и понатаму да се развиваат и да испробуваат нови работи. Бидете подготвени за некои ситни проблеми на почетокот на годината, бидејќи ќе имате предизвици во однос на кариерата, но тоа не е ништо невозможно. Сигурно ќе се појави некоја посебна личност која ќе се труди да го добие вашето внимание, но држете ги страстите под контрола. Не сакате ветувањето на вечна љубов да изгори во пламенот на оваа романса.");
        }

        private void Vodolijaslika_Click(object sender, EventArgs e)
        {
            Vodolijaslika.BorderStyle = BorderStyle.Fixed3D;
            vodolijalbl.BackColor = Color.Orchid;
            Form2 f2 = new Form2();
            f2.Visible = true;
            f2.Activate();
            f2.SetDesktopLocation(x, y);

            f2.setDneven("Некоја деловна понуда многу ќе ве заинтересира, но одлуката ќе биде тешка. Енергијата ви е на ниско ниво, па затоа ве советуваме да не се напрегате премногу. Материјалната состојба нема да ве загрижува. Во љубовта бидете потолерантни ако сакате да ја сочувате повторно воспоставената врска. Здраствената состојба ви е добра, одмарајте се повеќе и внимавајте од повреди.");
            f2.SetZnak("ВОДОЛИЈА\n(20.01 – 18.02)");
            f2.setNedelen("Работа:Ве очекуваат доста новини во полето на работата, особено оние кои се занимаваат со интелектуална работа. На ова поле најдобро ќе ги извршувате работните задачи, највероватно поради добрата интуицијата и концентрацијата која неделава ќе доминира кај вас. Доколку работата ви е поврзана со повеќе луѓе, контактитете ќе ве измачуваат. Не влегувјте во непотребни расправии. Гледајте си ја вашата работа. Финансиската состојба и покрај сите очекувања, останува иста. Љубов: Во љубовта не се препуштајте само на вашите страсти туку погледнете малку и во срцето на вашиот партнер. Можете да очекувате мали недоразбирања со партнерот околу роднинските односи. Потрудете се да се дистанцирате од вообичаените семејни нетрпенија. Бидете подготвени на компромиси. Слободните претставници ќе сакаат да се запознаат со личност која не покажува никакви интереси. Здравје: Здраствената состојба ви е релативно добра, земајте ги редовно лековите кои ви ги препишал вашиот лекар.");
            f2.setMesecen("Мај 2014 \n Работа: Мај ќе го обележат нови контакти, службени патувања... Ве очекува еден поинтензивен период во кој ќе знаете да уживате и при тоа деловно да напредувате. Ако во претходниот период неправедно сте ја изгубиле позицијата, работното место... веќе ќе има придвижувања кои ви овозможуваат праведно решение. Само бидете трпеливи. Љубов: На почетокот од месецот може да дојде до познанство со исклучително популарна или успешна личност. Таа сигурност и чувство на задоволство, стил на уживање, ќе ве освои на свој начин. Постоти само еден проблем. Партнерот најверојатно е веќе зафатен. На домашни забави или прослави ве очекува пријатно изненадување. Личноста што ви се допаѓа отворено ќе покаже интерес за вас. Првата средба со новиот сосед кај вас ќе побуди голем интерес. Во оваа ситуација само бидете трпеливи, ќе дојдат денови кои ќе ви овозможат многу повеќе. Во втората недела од мај во вашето астролошко поле на љубовта влегува природниот владетел. Тоа е веќе добро навестување за убави љубовни случувања. Сè се случува преку контакти, дружења, движења, патувања, преку пријатели... Ќе бидете исклучително активни и отворени за љубов. Вие треба да одберете што е повесело за вас. Се активира влегување во дупли врски.Здравје: На здравствено поле силно ве поддржува Јупитер. Добро здравје и добро опоравување ако веќе сте имале некакви проблеми.");
            f2.setGodisen("2014 Водолиите се познати по својот пријателски карактер. Некои од карактеристиките кои ги привлекуваат другите кај вас се искреноста и љубезноста. Исто така, довербата ви е силна страна. Дел од вашата популарност се крие во независноста, заради што може да делувате недостижно и мистериозно понекогаш.Годишниот хороскоп за Водолиите покажува поголемо интересирање околу животните мистерии кои веќе долго време ве мачат.Нема да покажете интересирање за луѓе кои во вас не будат креативни идеи, туку ќе се насочите кон оние кои ве исполнуваат.2014 година ќе биде доста поволна, но сепак подгответе се за мирна година во која ќе ги собирате наградите за веќе вложениот труд.");
        }

        private void button1_Click(object sender, EventArgs e)
        {
           
                if (((comboBox2.SelectedIndex >= 20 && comboBox2.SelectedIndex <= 39) && comboBox1.SelectedIndex == 3) || ((comboBox2.SelectedIndex >= 1 && comboBox2.SelectedIndex <= 21) && comboBox1.SelectedIndex == 4))
                {
                    MessageBox.Show("Во хороскоп сте бик");


                }

                else if (((comboBox2.SelectedIndex >= 21 && comboBox2.SelectedIndex <= 30) && comboBox1.SelectedIndex == 4) || ((comboBox2.SelectedIndex >= 0 && comboBox2.SelectedIndex <= 21) && comboBox1.SelectedIndex == 5))
                {
                    MessageBox.Show("Во хороскоп сте близнаци");
                }

                else if (((comboBox2.SelectedIndex >= 23 && comboBox2.SelectedIndex <= 30) && comboBox1.SelectedIndex == 7) || ((comboBox2.SelectedIndex >= 0 && comboBox2.SelectedIndex <= 22) && comboBox1.SelectedIndex == 8))
                {
                    MessageBox.Show("Во хороскоп сте девица");
                }

                else if (((comboBox2.SelectedIndex >= 21 && comboBox2.SelectedIndex <= 30) && comboBox1.SelectedIndex == 11) || ((comboBox2.SelectedIndex >= 0 && comboBox2.SelectedIndex <= 19) && comboBox1.SelectedIndex == 0))
                {
                    MessageBox.Show("Во хороскоп сте Јарец");
                }

                else if (((comboBox2.SelectedIndex >= 23 && comboBox2.SelectedIndex <= 30) && comboBox1.SelectedIndex == 6) || ((comboBox2.SelectedIndex >= 0 && comboBox2.SelectedIndex <= 22) && comboBox1.SelectedIndex == 7))
                {
                    MessageBox.Show("Во хороскоп сте Лав");
                }

                else if (((comboBox2.SelectedIndex >= 20 && comboBox2.SelectedIndex <= 30) && comboBox1.SelectedIndex == 2) || ((comboBox2.SelectedIndex >= 0 && comboBox2.SelectedIndex <= 19) && comboBox1.SelectedIndex == 3))
                {
                    MessageBox.Show("Во хороскоп сте Овен");
                }

                else if (((comboBox2.SelectedIndex >= 22 && comboBox2.SelectedIndex <= 29) && comboBox1.SelectedIndex == 5) || ((comboBox2.SelectedIndex >= 0 && comboBox2.SelectedIndex <= 22) && comboBox1.SelectedIndex == 6))
                {
                    MessageBox.Show("Во хороскоп сте Рак");
                }

                else if (((comboBox2.SelectedIndex >= 19 && comboBox2.SelectedIndex <= 28) && comboBox1.SelectedIndex == 1) || ((comboBox2.SelectedIndex >= 0 && comboBox2.SelectedIndex <= 19) && comboBox1.SelectedIndex == 2))
                {
                    MessageBox.Show("Во хороскоп сте Риби");
                }

                else if (((comboBox2.SelectedIndex >= 23 && comboBox2.SelectedIndex <= 30) && comboBox1.SelectedIndex == 9) || ((comboBox2.SelectedIndex >= 0 && comboBox2.SelectedIndex <= 21) && comboBox1.SelectedIndex == 10))
                {
                    MessageBox.Show("Во хороскоп сте Шкорпија");
                }

                else if (((comboBox2.SelectedIndex >= 22 && comboBox2.SelectedIndex <= 30) && comboBox1.SelectedIndex == 10) || ((comboBox2.SelectedIndex >= 0 && comboBox2.SelectedIndex <= 20) && comboBox1.SelectedIndex == 11))
                {
                    MessageBox.Show("Во хороскоп сте Стрелец");
                }

                else if (((comboBox2.SelectedIndex >= 23 && comboBox2.SelectedIndex <= 29) && comboBox1.SelectedIndex == 8) || ((comboBox2.SelectedIndex >= 0 && comboBox2.SelectedIndex <= 22) && comboBox1.SelectedIndex == 3))
                {
                    MessageBox.Show("Во хороскоп сте Вага");
                }

                else if (((comboBox2.SelectedIndex >= 20 && comboBox2.SelectedIndex <= 30) && comboBox1.SelectedIndex == 0) || ((comboBox2.SelectedIndex >= 0 && comboBox2.SelectedIndex <= 18) && comboBox1.SelectedIndex == 1))
                {
                    MessageBox.Show("Во хороскоп сте Водолија");
                }
                else 
                {
                    MessageBox.Show("Одберете датум");
                }
           
        }

        private void Form1_Load(object sender, EventArgs e)
        {

        }

    }
}
